devdnl/dnx-rtos/src/system/drivers/gpio/stm32f4/gpio_cfg.h
/*=========================================================================*//**
@file    gpio_cfg.h

@author  Daniel Zorychta

@brief   This driver support GPIO. Set here driver configuration.

@note    Copyright (C) 2017  Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

#ifndef _GPIO_CFG_H_
#define _GPIO_CFG_H_

#ifdef __cplusplus
extern "C" {
#endif

/*==============================================================================
  Include files
==============================================================================*/
#include "stm32f4/stm32f4xx.h"
#include "stm32f4/gpio_macros.h"

/*==============================================================================
  Exported symbolic constants/macros
==============================================================================*/
/** macro creates an enumerator with pin data */
#define _PIN_CONFIGURATION(port, port_idx, number, pin_name, mode, speed, af, state) \
enum port##_##number##_CFG {\
        _CONCAT(IOCTL_GPIO_PIN_IDX__, pin_name) = number,\
        _CONCAT(IOCTL_GPIO_PIN_MASK__, pin_name) = (1 << (number)),\
        _CONCAT(IOCTL_GPIO_PORT_IDX__, pin_name) = port_idx,\
        _CONCAT(_GPIO_, pin_name) = port##_BASE,\
        _CONCAT(_BP_, pin_name) = (number),\
        _CONCAT(_BM_, pin_name) = (1 << (number)),\
        _##port##_PIN_##number##_MODE  = (((u32_t)(mode) >> 8) & 0x3),\
        _##port##_PIN_##number##_TYPE  = (((u32_t)(mode) >> 4) & 0x1),\
        _##port##_PIN_##number##_PUPD  = (((u32_t)(mode) >> 0) & 0x3),\
        _##port##_PIN_##number##_SPEED = (speed),\
        _##port##_PIN_##number##_STATE = (state),\
        _##port##_PIN_##number##_AF    = (af),\
}

/** GPIO pin NONE definition */
#define _GPIO_NONE_BASE 0
_PIN_CONFIGURATION(_GPIO_NONE, 16, 17, NONE, _GPIO_MODE_ANALOG, _GPIO_SPEED_LOW, 0, _LOW);

/** GPIOA pins configuration */
#if defined(RCC_AHB1ENR_GPIOAEN)
_PIN_CONFIGURATION(GPIOA, 0, 0, __GPIO_PA_PIN_0_NAME__, __GPIO_PA_PIN_0_MODE__, __GPIO_PA_PIN_0_SPEED__, __GPIO_PA_PIN_0_AF__, __GPIO_PA_PIN_0_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 1, __GPIO_PA_PIN_1_NAME__, __GPIO_PA_PIN_1_MODE__, __GPIO_PA_PIN_1_SPEED__, __GPIO_PA_PIN_1_AF__, __GPIO_PA_PIN_1_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 2, __GPIO_PA_PIN_2_NAME__, __GPIO_PA_PIN_2_MODE__, __GPIO_PA_PIN_2_SPEED__, __GPIO_PA_PIN_2_AF__, __GPIO_PA_PIN_2_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 3, __GPIO_PA_PIN_3_NAME__, __GPIO_PA_PIN_3_MODE__, __GPIO_PA_PIN_3_SPEED__, __GPIO_PA_PIN_3_AF__, __GPIO_PA_PIN_3_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 4, __GPIO_PA_PIN_4_NAME__, __GPIO_PA_PIN_4_MODE__, __GPIO_PA_PIN_4_SPEED__, __GPIO_PA_PIN_4_AF__, __GPIO_PA_PIN_4_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 5, __GPIO_PA_PIN_5_NAME__, __GPIO_PA_PIN_5_MODE__, __GPIO_PA_PIN_5_SPEED__, __GPIO_PA_PIN_5_AF__, __GPIO_PA_PIN_5_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 6, __GPIO_PA_PIN_6_NAME__, __GPIO_PA_PIN_6_MODE__, __GPIO_PA_PIN_6_SPEED__, __GPIO_PA_PIN_6_AF__, __GPIO_PA_PIN_6_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 7, __GPIO_PA_PIN_7_NAME__, __GPIO_PA_PIN_7_MODE__, __GPIO_PA_PIN_7_SPEED__, __GPIO_PA_PIN_7_AF__, __GPIO_PA_PIN_7_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 8, __GPIO_PA_PIN_8_NAME__, __GPIO_PA_PIN_8_MODE__, __GPIO_PA_PIN_8_SPEED__, __GPIO_PA_PIN_8_AF__, __GPIO_PA_PIN_8_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 9, __GPIO_PA_PIN_9_NAME__, __GPIO_PA_PIN_9_MODE__, __GPIO_PA_PIN_9_SPEED__, __GPIO_PA_PIN_9_AF__, __GPIO_PA_PIN_9_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 10, __GPIO_PA_PIN_10_NAME__, __GPIO_PA_PIN_10_MODE__, __GPIO_PA_PIN_10_SPEED__, __GPIO_PA_PIN_10_AF__, __GPIO_PA_PIN_10_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 11, __GPIO_PA_PIN_11_NAME__, __GPIO_PA_PIN_11_MODE__, __GPIO_PA_PIN_11_SPEED__, __GPIO_PA_PIN_11_AF__, __GPIO_PA_PIN_11_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 12, __GPIO_PA_PIN_12_NAME__, __GPIO_PA_PIN_12_MODE__, __GPIO_PA_PIN_12_SPEED__, __GPIO_PA_PIN_12_AF__, __GPIO_PA_PIN_12_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 13, __GPIO_PA_PIN_13_NAME__, __GPIO_PA_PIN_13_MODE__, __GPIO_PA_PIN_13_SPEED__, __GPIO_PA_PIN_13_AF__, __GPIO_PA_PIN_13_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 14, __GPIO_PA_PIN_14_NAME__, __GPIO_PA_PIN_14_MODE__, __GPIO_PA_PIN_14_SPEED__, __GPIO_PA_PIN_14_AF__, __GPIO_PA_PIN_14_STATE__);
_PIN_CONFIGURATION(GPIOA, 0, 15, __GPIO_PA_PIN_15_NAME__, __GPIO_PA_PIN_15_MODE__, __GPIO_PA_PIN_15_SPEED__, __GPIO_PA_PIN_15_AF__, __GPIO_PA_PIN_15_STATE__);
#endif

/** GPIOB pins configuration */
#if defined(RCC_AHB1ENR_GPIOBEN)
_PIN_CONFIGURATION(GPIOB, 1, 0, __GPIO_PB_PIN_0_NAME__, __GPIO_PB_PIN_0_MODE__, __GPIO_PB_PIN_0_SPEED__, __GPIO_PB_PIN_0_AF__, __GPIO_PB_PIN_0_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 1, __GPIO_PB_PIN_1_NAME__, __GPIO_PB_PIN_1_MODE__, __GPIO_PB_PIN_1_SPEED__, __GPIO_PB_PIN_1_AF__, __GPIO_PB_PIN_1_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 2, __GPIO_PB_PIN_2_NAME__, __GPIO_PB_PIN_2_MODE__, __GPIO_PB_PIN_2_SPEED__, __GPIO_PB_PIN_2_AF__, __GPIO_PB_PIN_2_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 3, __GPIO_PB_PIN_3_NAME__, __GPIO_PB_PIN_3_MODE__, __GPIO_PB_PIN_3_SPEED__, __GPIO_PB_PIN_3_AF__, __GPIO_PB_PIN_3_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 4, __GPIO_PB_PIN_4_NAME__, __GPIO_PB_PIN_4_MODE__, __GPIO_PB_PIN_4_SPEED__, __GPIO_PB_PIN_4_AF__, __GPIO_PB_PIN_4_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 5, __GPIO_PB_PIN_5_NAME__, __GPIO_PB_PIN_5_MODE__, __GPIO_PB_PIN_5_SPEED__, __GPIO_PB_PIN_5_AF__, __GPIO_PB_PIN_5_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 6, __GPIO_PB_PIN_6_NAME__, __GPIO_PB_PIN_6_MODE__, __GPIO_PB_PIN_6_SPEED__, __GPIO_PB_PIN_6_AF__, __GPIO_PB_PIN_6_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 7, __GPIO_PB_PIN_7_NAME__, __GPIO_PB_PIN_7_MODE__, __GPIO_PB_PIN_7_SPEED__, __GPIO_PB_PIN_7_AF__, __GPIO_PB_PIN_7_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 8, __GPIO_PB_PIN_8_NAME__, __GPIO_PB_PIN_8_MODE__, __GPIO_PB_PIN_8_SPEED__, __GPIO_PB_PIN_8_AF__, __GPIO_PB_PIN_8_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 9, __GPIO_PB_PIN_9_NAME__, __GPIO_PB_PIN_9_MODE__, __GPIO_PB_PIN_9_SPEED__, __GPIO_PB_PIN_9_AF__, __GPIO_PB_PIN_9_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 10, __GPIO_PB_PIN_10_NAME__, __GPIO_PB_PIN_10_MODE__, __GPIO_PB_PIN_10_SPEED__, __GPIO_PB_PIN_10_AF__, __GPIO_PB_PIN_10_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 11, __GPIO_PB_PIN_11_NAME__, __GPIO_PB_PIN_11_MODE__, __GPIO_PB_PIN_11_SPEED__, __GPIO_PB_PIN_11_AF__, __GPIO_PB_PIN_11_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 12, __GPIO_PB_PIN_12_NAME__, __GPIO_PB_PIN_12_MODE__, __GPIO_PB_PIN_12_SPEED__, __GPIO_PB_PIN_12_AF__, __GPIO_PB_PIN_12_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 13, __GPIO_PB_PIN_13_NAME__, __GPIO_PB_PIN_13_MODE__, __GPIO_PB_PIN_13_SPEED__, __GPIO_PB_PIN_13_AF__, __GPIO_PB_PIN_13_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 14, __GPIO_PB_PIN_14_NAME__, __GPIO_PB_PIN_14_MODE__, __GPIO_PB_PIN_14_SPEED__, __GPIO_PB_PIN_14_AF__, __GPIO_PB_PIN_14_STATE__);
_PIN_CONFIGURATION(GPIOB, 1, 15, __GPIO_PB_PIN_15_NAME__, __GPIO_PB_PIN_15_MODE__, __GPIO_PB_PIN_15_SPEED__, __GPIO_PB_PIN_15_AF__, __GPIO_PB_PIN_15_STATE__);
#endif

